simulationCases/SSC_pisoFoamTurbine_debug/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    lower
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10000;
        startFace       973400;
    }
    upper
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10000;
        startFace       983400;
    }
    west
    {
        type            patch;
        nFaces          3300;
        startFace       993400;
    }
    east
    {
        type            patch;
        nFaces          3300;
        startFace       996700;
    }
    north
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3300;
        startFace       1000000;
    }
    south
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3300;
        startFace       1003300;
    }
)

// ************************************************************************* //
