simulationCases/SSC_pisoFoamTurbine_debug/constant/turbineArrayProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbineProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

globalProperties
{
    outputControl       "timeStep";
//  outputControl       "runTime";
    outputInterval       1;
}


// _SSC_
sscProperties
{
    sscEnabled          true; //Enable/disable ssc, if not present defaults to False
    nInputsToSSC        3; // Number of inputs EACH turbine passes to the super controller
    nOutputsFromSSC     2; // Number of outputs the super controller sends to EACH turbine
    sscControllerType   "zeromqSSC"; // The type of SSC
}

// MATLAB: phi=-10; D=126.4; locs=D*[0 0 0;0 2 0;0 4 0;5 0 0; 5 2 0; 5 4 0; 10 0 0; 10 2 0; 10 4 0]*rotz(phi);
//         locs(:,1)=locs(:,1)-min(locs(:,1)) + (3000-(max(locs(:,1))-min(locs(:,1))))/2; locs(:,2)=locs(:,2)-min(locs(:,2)) + (3000-(max(locs(:,2))-min(locs(:,2))))/2;

turbine0
{
    turbineType         "NREL5MWRef";
    baseLocation        (868.0  1120.8 0.0);
    nRadial              64;
    azimuthMaxDis        2.0;
    nAvgSector           1;
    pointDistType       "uniform";
    pointInterpType     "linear";
    bladeUpdateType     "oldPosition";
    epsilon              20.0;
    forceScalar          1.0;
    inflowVelocityScalar 0.94;
    tipRootLossCorrType "Glauert";
    rotationDir         "cw";
    Azimuth              0.0;
    RotSpeed             9.15519863;
    TorqueGen            0.0;
    Pitch                0.0;
    NacYaw             270.0;
    fluidDensity         1.225;
}

turbine1
{
    turbineType         "NREL5MWRef";
    baseLocation        (868.0  1500.0 0.0);
    nRadial              64;
    azimuthMaxDis        2.0;
    nAvgSector           1;
    pointDistType       "uniform";
    pointInterpType     "linear";
    bladeUpdateType     "oldPosition";
    epsilon              20.0;
    forceScalar          1.0;
    inflowVelocityScalar 0.94;
    tipRootLossCorrType "Glauert";
    rotationDir         "cw";
    Azimuth              0.0;
    RotSpeed             9.15519863;
    TorqueGen            0.0;
    Pitch                0.0;
    NacYaw             270.0;
    fluidDensity         1.225;
}

turbine2
{
    turbineType         "NREL5MWRef";
    baseLocation        (868.0  1879.2 0.0);
    nRadial              64;
    azimuthMaxDis        2.0;
    nAvgSector           1;
    pointDistType       "uniform";
    pointInterpType     "linear";
    bladeUpdateType     "oldPosition";
    epsilon              20.0;
    forceScalar          1.0;
    inflowVelocityScalar 0.94;
    tipRootLossCorrType "Glauert";
    rotationDir         "cw";
    Azimuth              0.0;
    RotSpeed             9.15519863;
    TorqueGen            0.0;
    Pitch                0.0;
    NacYaw             270.0;
    fluidDensity         1.225;
}

turbine3
{
    turbineType         "NREL5MWRef";
    baseLocation        (1500.0 1120.8 0.0);
    nRadial              64;
    azimuthMaxDis        2.0;
    nAvgSector           1;
    pointDistType       "uniform";
    pointInterpType     "linear";
    bladeUpdateType     "oldPosition";
    epsilon              20.0;
    forceScalar          1.0;
    inflowVelocityScalar 0.94;
    tipRootLossCorrType "Glauert";
    rotationDir         "cw";
    Azimuth              0.0;
    RotSpeed             9.15519863;
    TorqueGen            0.0;
    Pitch                0.0;
    NacYaw             270.0;
    fluidDensity         1.225;
}

turbine4
{
    turbineType         "NREL5MWRef";
    baseLocation        (1500.0 1500.0 0.0);
    nRadial              64;
    azimuthMaxDis        2.0;
    nAvgSector           1;
    pointDistType       "uniform";
    pointInterpType     "linear";
    bladeUpdateType     "oldPosition";
    epsilon              20.0;
    forceScalar          1.0;
    inflowVelocityScalar 0.94;
    tipRootLossCorrType "Glauert";
    rotationDir         "cw";
    Azimuth              0.0;
    RotSpeed             9.15519863;
    TorqueGen            0.0;
    Pitch                0.0;
    NacYaw             270.0;
    fluidDensity         1.225;
}

turbine5
{
    turbineType         "NREL5MWRef";
    baseLocation        (1500.0 1879.2 0.0);
    nRadial              64;
    azimuthMaxDis        2.0;
    nAvgSector           1;
    pointDistType       "uniform";
    pointInterpType     "linear";
    bladeUpdateType     "oldPosition";
    epsilon              20.0;
    forceScalar          1.0;
    inflowVelocityScalar 0.94;
    tipRootLossCorrType "Glauert";
    rotationDir         "cw";
    Azimuth              0.0;
    RotSpeed             9.15519863;
    TorqueGen            0.0;
    Pitch                0.0;
    NacYaw             270.0;
    fluidDensity         1.225;
}

turbine6
{
    turbineType         "NREL5MWRef";
    baseLocation        (2132.0 1120.8 0.0);
    nRadial              64;
    azimuthMaxDis        2.0;
    nAvgSector           1;
    pointDistType       "uniform";
    pointInterpType     "linear";
    bladeUpdateType     "oldPosition";
    epsilon              20.0;
    forceScalar          1.0;
    inflowVelocityScalar 0.94;
    tipRootLossCorrType "Glauert";
    rotationDir         "cw";
    Azimuth              0.0;
    RotSpeed             9.15519863;
    TorqueGen            0.0;
    Pitch                0.0;
    NacYaw             270.0;
    fluidDensity         1.225;
}

turbine7
{
    turbineType         "NREL5MWRef";
    baseLocation        (2132.0 1500.0 0.0);
    nRadial              64;
    azimuthMaxDis        2.0;
    nAvgSector           1;
    pointDistType       "uniform";
    pointInterpType     "linear";
    bladeUpdateType     "oldPosition";
    epsilon              20.0;
    forceScalar          1.0;
    inflowVelocityScalar 0.94;
    tipRootLossCorrType "Glauert";
    rotationDir         "cw";
    Azimuth              0.0;
    RotSpeed             9.15519863;
    TorqueGen            0.0;
    Pitch                0.0;
    NacYaw             270.0;
    fluidDensity         1.225;
}

turbine8
{
    turbineType         "NREL5MWRef";
    baseLocation        (2132.0 1879.2 0.0);
    nRadial              64;
    azimuthMaxDis        2.0;
    nAvgSector           1;
    pointDistType       "uniform";
    pointInterpType     "linear";
    bladeUpdateType     "oldPosition";
    epsilon              20.0;
    forceScalar          1.0;
    inflowVelocityScalar 0.94;
    tipRootLossCorrType "Glauert";
    rotationDir         "cw";
    Azimuth              0.0;
    RotSpeed             9.15519863;
    TorqueGen            0.0;
    Pitch                0.0;
    NacYaw             270.0;
    fluidDensity         1.225;
}